#pragma once


// =====================================================
// 时间管理模块
//
// 功能：
//
// 1. 管理系统时间
// 2. WiFi连接后进行NTP同步
// 3. 定期自动校时
// 4. 为未来RTC模块预留接口
//
// 当前时间来源：
// NTP
//
// 未来时间来源：
// RTC芯片
//
// =====================================================


// 初始化时间模块
void time_init();

// 时间任务
// 放入main.cpp loop中循环调用
// 非阻塞
void time_task();

// 手动触发NTP同步
// 返回：
// true  成功
// false 失败
bool time_sync_ntp();

// 获取当前时间字符串
// 示例：
// 2026-07-17 12:30:20
String time_get_string();

// RTC同步接口
// 当前为空
// RTC模块到货后实现
void time_sync_to_rtc();
